api-captcha/tests/load-test.yml
config:
  target: "http://localhost:3001"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 50
      name: "Sustained load"

scenarios:
  - name: "Test API endpoints"
    flow:
      - get:
          url: "/api/stats"
          expect:
            - statusCode: 200
      - get:
          url: "/api/captcha"
          expect:
            - statusCode: 200